FPATH = ("..", "Data", "MyHanziData")
FontsPATH = ("..", "Data", "Fonts")
sentence_example = "收到货后，打开一看，令我大失所望，正面一层薄薄的人造革，背面无纺布，做工粗糙，便宜没好货，说的真没错啊，那么多好评怎么来的，我都纳闷了？"
sentence_faltten = "旨在定义一个稳定、最小化、可移植白勺语言版本以及相应的木示准库，以用于教学和作为将来扩展的基础。"
sentence_changed = "指在定议一个稳定、最小化、苛移植的语言版本以及相应的标准库，笖苚于教学和作伪将来扩展的基础。"
img_size = 50
pun = set('，。/；’【】、·~+-*/《》？：”{}|——+、！@#￥%……&*（）'
          ',./;\'[]-=`~<>?:"{}|\\!@#$%^&*()'
          '1234567890'
          'qwertyuiopasdfghjklzxcvbnm'
          'QWERTYUIOPASDFGHJKLZXCVBNM')

insert_bihua = '丄丅丆丶丷丿乀亠乄卝亅乁乛爫凵冂冖'
insert_japan = 'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺ' \
               'ほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジ' \
               'スズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲン' \
               'ヴヵヶヷヸヹヺ・ーヽヾ'
pianpang='亻長八殳糸爪谷雨黄弓骨甘艹白車门凵辰氏匚辶母夂聿黽广尣冂竹冫虍金止皮臼卝亅用血韋乙巾犭刀尸瓦行虫灬舟色鼠酉牛囗龍尢彳豕香馬车' \
         '大鬼言魚欠冖而采身鹵讠页至辵牜卤厶饣里肀长兀艮鬥彡面丿禾弋玄厂一日衤克己覀纟十亠麥韦支廴羽比赤米豸戈斗爿疒見夕生非麻巳丶口釒黹' \
         '耂已卩几刂火攵首齒田旡土匕二山臣麦氵音屮鳥鼓斤鬲攴艸貝癶鬯豆舌先齿乚石龙走爻韭齊毛犬瓜耳女心罒衣靣高皿鸟业邑矛忄无曰足月镸入疋耒' \
         '革頁龠扌工气阜礻示彐厄毋歹手宀缶青鼻黑彑木風丨飞歺穴髟马玉卜立隶文儿阝矢自又羊黍贝片干力方勹廾父钅飠户人乛子小风士角鹿匸饣丬牙目' \
         '巛鱼鼎齐隹丷川见靑水肉寸幺辛爫門糹王'
